# 对照表
方案一：纯光谱编码对照表（用于中间光速计算，输入光，输出光）
输入操作	输入光波长 1	输入光波长 2	控制电压	物理过程	输出光波长	对应数学结果
状态 -1	1550 nm	-	0.0 V	吸收阻断	无透射	-1
状态 0	1540 nm	-	2.0 V	谐振透射	1540 nm	0
状态 1	1530 nm	-	4.0 V	谐振透射	1530 nm	1
加法 (和频)	1550 nm (代表-1)	1540 nm (代表0)	2.0 V	两个光子融合变色	772.4 nm	-1(相加)
减法 (差频)	1530 nm (代表1)	1540 nm (参考基准)	2.0 V	光子分裂变色	中红外光	1(相减)
乘法 (衰减)	输入光强 A	-	调节电压	调透光率打折	输出光强	A × 权重



方案二：光致电压对照表（用于最终结果输出，光照产生电压，直接测电压得结果）
芯片内部状态	光照反应	电极测出的感应电压	最终解码数字
无共振 / 无光	几乎没有光电流	0.00 V ~ 0.05 V	0
单方向光栅聚能	产生正常光电流	0.18 V ~ 0.25 V	1
十字中心超强聚能	产生高密度强光电流	0.55 V ~ 0.70 V	2
超强光饱和	电流达到上限	> 0.85 V	溢出 / 报错
